test/support/ex_vcr/coupon_code.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Accept": "application/json; charset=utf8",
        "Accept-Encoding": "gzip",
        "Authorization": "Bearer random_sk_test_51HZXWAEMShkCsLFnX5gePfEYnt2czwXjNg92lD7cC",
        "Connection": "keep-alive",
        "Content-Type": "application/x-www-form-urlencoded",
        "Stripe-Version": "2019-12-03",
        "User-Agent": "Stripe/v1 stripity-stripe/2019-12-03"
      },
      "method": "get",
      "options": {
        "pool": "Elixir.Stripe.API",
        "with_body": "true"
      },
      "request_body": "",
      "url": "https://api.stripe.com/v1/promotion_codes?code=P3MU8SEB"
    },
    "response": {
      "binary": false,
      "body": "{\n  \"object\": \"list\",\n  \"data\": [\n    {\n      \"id\": \"promo_1IkMTJEMShkCsLFnjNbuS3mr\",\n      \"object\": \"promotion_code\",\n      \"active\": true,\n      \"code\": \"P3MU8SEB\",\n      \"coupon\": {\n        \"id\": \"mWH5sXEw\",\n        \"object\": \"coupon\",\n        \"amount_off\": 1500000,\n        \"created\": 1619412900,\n        \"currency\": \"inr\",\n        \"duration\": \"once\",\n        \"duration_in_months\": null,\n        \"livemode\": false,\n        \"max_redemptions\": null,\n        \"metadata\": {\n          \"description\": \"Setup fee discount for initial NGO's\"\n        },\n        \"name\": \"First discount\",\n        \"percent_off\": null,\n        \"redeem_by\": null,\n        \"times_redeemed\": 10,\n        \"valid\": true\n      },\n      \"created\": 1619412901,\n      \"customer\": null,\n      \"expires_at\": null,\n      \"livemode\": false,\n      \"max_redemptions\": null,\n      \"metadata\": {\n      },\n      \"restrictions\": {\n        \"first_time_transaction\": false,\n        \"minimum_amount\": null,\n        \"minimum_amount_currency\": null\n      },\n      \"times_redeemed\": 0\n    }\n  ],\n  \"has_more\": false,\n  \"url\": \"/v1/promotion_codes\"\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Wed, 28 Apr 2021 08:37:08 GMT",
        "Content-Type": "application/json",
        "Content-Length": "1102",
        "Connection": "keep-alive",
        "access-control-allow-credentials": "true",
        "access-control-allow-methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "access-control-allow-origin": "*",
        "access-control-expose-headers": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required",
        "access-control-max-age": "300",
        "cache-control": "no-cache, no-store",
        "request-id": "req_DD9ZWW5mncUxXA",
        "stripe-version": "2019-12-03",
        "x-envoy-attempt-count": "1",
        "x-stripe-c-cost": "0",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains; preload"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]